## Step 1: Imports

In [2]:
import pandas as pd
import plotly.express as px

import sqlalchemy

## Step 1b: Import the Data

In [5]:
df=pd.read_csv(r'C:\Users\ALIYA\OneDrive\Documents\Coding_Temple\Week 6\Day2\Tableau_Assignment_II\Taylor_Train.csv',encoding=('unicode_escape'))

## Step 2: Tidy my Data

* Column names need to follow PEP 8 Compliance

In [6]:
df.columns = df.columns.str.replace(' ', '_').str.strip().str.lower()

In [7]:
df.head()

,city,country,venue,opening_act(s),attendance_(tickets_sold_/_available),revenue,tour
0,Evansville,United States,Roberts Municipal Stadium,Gloriana\r\nKellie Pickler,"7,463 / 7,463","$360,617",Fearless_Tour
1,Jonesboro,United States,Convocation Center,Gloriana\r\nKellie Pickler,"7,822 / 7,822","$340,328",Fearless_Tour
2,St. Louis,United States,Scottrade Center,Gloriana\r\nKellie Pickler,"13,764 / 13,764","$650,420",Fearless_Tour
3,Alexandria,United States,Bishop Ireton High School,Gloriana\r\nKellie Pickler,,,Fearless_Tour
4,North Charleston,United States,North Charleston Coliseum,Gloriana\r\nKellie Pickler,"8,751 / 8,751","$398,154",Fearless_Tour

### Step 3: EDA (Exploratory Data Analysis)

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 445 entries, 0 to 444
Data columns (total 7 columns):
 #   Column                                 Non-Null Count  Dtype
---  ------                                 --------------  -----
 0   city                                   445 non-null    object
 1   country                                445 non-null    object
 2   venue                                  445 non-null    object
 3   opening_act(s)                         444 non-null    object
 4   attendance_(tickets_sold_/_available)  442 non-null    object
 5   revenue                                442 non-null    object
 6   tour                                   445 non-null    object
dtypes: object(7)
memory usage: 24.5+ KB

In [25]:
df['revenue'] = df['revenue'].str.replace('$', '')
df['revenue'] = df['revenue'].str.replace(',', '')
df['revenue'] = df['revenue'].str.replace('', '0')
df['attendance_(tickets_sold_/_available)'] = df['attendance_(tickets_sold_/_available)'].str.replace('', '0')
df = df.dropna()
df['revenue'] = df['revenue'].astype(int)
df

C:\Users\ALIYA\AppData\Local\Temp\ipykernel_26240\1097561089.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['revenue'] = df['revenue'].astype(int)

,city,country,venue,opening_act(s),attendance_(tickets_sold_/_available),revenue,tour
0,Evansville,United States,Roberts Municipal Stadium,Gloriana\r\nKellie Pickler,"7,463 / 7,463",360617,Fearless_Tour
1,Jonesboro,United States,Convocation Center,Gloriana\r\nKellie Pickler,"7,822 / 7,822",340328,Fearless_Tour
2,St. Louis,United States,Scottrade Center,Gloriana\r\nKellie Pickler,"13,764 / 13,764",650420,Fearless_Tour
3,Alexandria,United States,Bishop Ireton High School,Gloriana\r\nKellie Pickler,0,0,Fearless_Tour
4,North Charleston,United States,North Charleston Coliseum,Gloriana\r\nKellie Pickler,"8,751 / 8,751",398154,Fearless_Tour
...,...,...,...,...,...,...,...
440,Sydney,Australia,ANZ Stadium,Charli XCX\r\nBroods,"72,805 / 72,805",7686564,Reputation_Stadium_Tour
441,Brisbane,Australia,The Gabba,Charli XCX\r\nBroods,"43,907 / 43,907",4338127,Reputation_Stadium_Tour
442,Auckland,New Zealand,Mount Smart Stadium,Charli XCX\r\nBroods,"35,749 / 35,749",3617593,Reputation_Stadium_Tour
443,Tokyo,Japan,Tokyo Dome,Charli XCX,"100,109 / 100,109",14859847,Reputation_Stadium_Tour
444,Tokyo,Japan,Tokyo Dome,Charli XCX,"100,109 / 100,109",14859847,Reputation_Stadium_Tour

In [9]:
data = df.dropna()

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 445 entries, 0 to 444
Data columns (total 7 columns):
 #   Column                                 Non-Null Count  Dtype
---  ------                                 --------------  -----
 0   city                                   445 non-null    object
 1   country                                445 non-null    object
 2   venue                                  445 non-null    object
 3   opening_act(s)                         444 non-null    object
 4   attendance_(tickets_sold_/_available)  442 non-null    object
 5   revenue                                442 non-null    object
 6   tour                                   445 non-null    object
dtypes: object(7)
memory usage: 24.5+ KB

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 441 entries, 0 to 444
Data columns (total 7 columns):
 #   Column                                 Non-Null Count  Dtype
---  ------                                 --------------  -----
 0   city                                   441 non-null    object
 1   country                                441 non-null    object
 2   venue                                  441 non-null    object
 3   opening_act(s)                         441 non-null    object
 4   attendance_(tickets_sold_/_available)  441 non-null    object
 5   revenue                                441 non-null    int32
 6   tour                                   441 non-null    object
dtypes: int32(1), object(6)
memory usage: 25.8+ KB

### Step 4: Upload to SQL Server now that the data is clean

In [28]:
# Create the connection string using sqlalchemy
my_conn = sqlalchemy.create_engine("mysql+mysqldb://admin:Cybergirl69@localhost/bonfire_124__schema")

In [29]:
df.to_sql('Taylor_swift', con = my_conn, index=False, if_exists='replace')

C:\Users\ALIYA\AppData\Local\Temp\ipykernel_26240\2683102335.py:1: UserWarning: The provided table name 'Taylor_swift' is not found exactly as such in the database after writing the table, possibly due to case sensitivity issues. Consider using lower case table names.
  df.to_sql('Taylor_swift', con = my_conn, index=False, if_exists='replace')

441

In [30]:
df = pd.read_sql('SELECT * FROM Taylor_swift', con = my_conn)

In [31]:
df.to_csv('Taylor_swift')